acrc/app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (username = 'oliver123' and password = '12345') LIMIT 1
---
def authenticate
    #User.new(params[:userform]) will create a new object of User, retrieve values from the form and store it variable @user.
    @user = User.new(params[:userform])
        #find records with username,password
    valid_user = User.find(:first,:conditions => ["username = ? and password = ?",@user.username, @user.password])