acrc/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`category`, `updated_at`, `username`, `firstname`, `lastname`, `password`, `created_at`) VALUES('teacher', '2010-08-26 16:06:48', 'oliver123', 'Oliver', 'Malabanan', '12345', '2010-08-26 16:06:48')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 8)
UPDATE `users` SET `lastname` = 'Astig', `firstname` = 'Mr. Enrico', `updated_at` = '2010-08-27 03:46:19' WHERE `id` = 8